LoadTesting/Initialize_Login_100-Staging.txt
Run #1:

Running 2m test @ https://staging-api.thriveglobal.com/users/initialize
  12 threads and 12 connections
  Thread calibration: mean lat.: 150.712ms, rate sampling interval: 631ms
  Thread calibration: mean lat.: 150.937ms, rate sampling interval: 608ms
  Thread calibration: mean lat.: 154.058ms, rate sampling interval: 705ms
  Thread calibration: mean lat.: 152.349ms, rate sampling interval: 607ms
  Thread calibration: mean lat.: 147.737ms, rate sampling interval: 606ms
  Thread calibration: mean lat.: 151.198ms, rate sampling interval: 604ms
  Thread calibration: mean lat.: 147.403ms, rate sampling interval: 605ms
  Thread calibration: mean lat.: 145.519ms, rate sampling interval: 604ms
  Thread calibration: mean lat.: 141.665ms, rate sampling interval: 605ms
  Thread calibration: mean lat.: 148.468ms, rate sampling interval: 602ms
  Thread calibration: mean lat.: 146.694ms, rate sampling interval: 603ms
  Thread calibration: mean lat.: 149.642ms, rate sampling interval: 603ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   277.30ms  480.30ms   2.41s    89.04%
    Req/Sec     7.93      1.34    11.00     96.35%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  101.95ms
 75.000%  122.18ms
 90.000%  899.07ms
 99.000%    2.25s
 99.900%    2.38s
 99.990%    2.41s
 99.999%    2.41s
100.000%    2.41s

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      83.839     0.000000            1         1.00
      92.159     0.100000         1103         1.11
      94.655     0.200000         2207         1.25
      96.831     0.300000         3331         1.43
      99.007     0.400000         4420         1.67
     101.951     0.500000         5507         2.00
     104.191     0.550000         6059         2.22
     107.263     0.600000         6608         2.50
     110.975     0.650000         7154         2.86
     116.159     0.700000         7708         3.33
     122.175     0.750000         8256         4.00
     126.719     0.775000         8532         4.44
     132.863     0.800000         8807         5.00
     143.487     0.825000         9081         5.71
     188.799     0.850000         9356         6.67
     513.791     0.875000         9629         8.00
     712.191     0.887500         9767         8.89
     899.071     0.900000         9904        10.00
    1069.055     0.912500        10042        11.43
    1242.111     0.925000        10179        13.33
    1420.287     0.937500        10317        16.00
    1501.183     0.943750        10386        17.78
    1590.271     0.950000        10454        20.00
    1693.695     0.956250        10523        22.86
    1790.975     0.962500        10592        26.67
    1886.207     0.968750        10661        32.00
    1945.599     0.971875        10695        35.56
    2006.015     0.975000        10729        40.00
    2065.407     0.978125        10764        45.71
    2125.823     0.981250        10798        53.33
    2170.879     0.984375        10835        64.00
    2195.455     0.985938        10852        71.11
    2220.031     0.987500        10867        80.00
    2238.463     0.989062        10884        91.43
    2271.231     0.990625        10901       106.67
    2287.615     0.992188        10922       128.00
    2291.711     0.992969        10927       142.22
    2299.903     0.993750        10936       160.00
    2312.191     0.994531        10947       182.86
    2314.239     0.995313        10954       213.33
    2328.575     0.996094        10962       256.00
    2332.671     0.996484        10969       284.44
    2334.719     0.996875        10971       320.00
    2340.863     0.997266        10974       365.71
    2357.247     0.997656        10983       426.67
    2357.247     0.998047        10983       512.00
    2359.295     0.998242        10985       568.89
    2365.439     0.998437        10988       640.00
    2367.487     0.998633        10989       731.43
    2379.775     0.998828        10996       853.33
    2379.775     0.999023        10996      1024.00
    2379.775     0.999121        10996      1137.78
    2379.775     0.999219        10996      1280.00
    2381.823     0.999316        10998      1462.86
    2381.823     0.999414        10998      1706.67
    2390.015     0.999512        10999      2048.00
    2392.063     0.999561        11002      2275.56
    2392.063     0.999609        11002      2560.00
    2392.063     0.999658        11002      2925.71
    2392.063     0.999707        11002      3413.33
    2392.063     0.999756        11002      4096.00
    2392.063     0.999780        11002      4551.11
    2392.063     0.999805        11002      5120.00
    2406.399     0.999829        11003      5851.43
    2406.399     0.999854        11003      6826.67
    2406.399     0.999878        11003      8192.00
    2406.399     0.999890        11003      9102.22
    2406.399     0.999902        11003     10240.00
    2410.495     0.999915        11004     11702.86
    2410.495     1.000000        11004          inf
#[Mean    =      277.297, StdDeviation   =      480.299]
#[Max     =     2408.448, Total count    =        11004]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  12011 requests in 2.00m, 4.27MB read
  Non-2xx or 3xx responses: 12011
Requests/sec:     99.97
Transfer/sec:     36.42KB


Run #2

Running 2m test @ https://staging-api.thriveglobal.com/users/initialize
  12 threads and 12 connections
  Thread calibration: mean lat.: 3195.610ms, rate sampling interval: 6975ms
  Thread calibration: mean lat.: 3000.206ms, rate sampling interval: 6914ms
  Thread calibration: mean lat.: 2893.883ms, rate sampling interval: 6873ms
  Thread calibration: mean lat.: 2985.373ms, rate sampling interval: 6893ms
  Thread calibration: mean lat.: 3016.339ms, rate sampling interval: 6877ms
  Thread calibration: mean lat.: 2980.836ms, rate sampling interval: 6873ms
  Thread calibration: mean lat.: 2970.240ms, rate sampling interval: 6889ms
  Thread calibration: mean lat.: 2996.251ms, rate sampling interval: 6893ms
  Thread calibration: mean lat.: 2979.330ms, rate sampling interval: 6914ms
  Thread calibration: mean lat.: 2969.958ms, rate sampling interval: 6893ms
  Thread calibration: mean lat.: 2895.580ms, rate sampling interval: 6832ms
  Thread calibration: mean lat.: 3040.162ms, rate sampling interval: 6889ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.50s     3.25s   10.07s    45.56%
    Req/Sec     7.82      2.03    10.00     84.78%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.66s
 75.000%    6.40s
 90.000%    8.28s
 99.000%    9.69s
 99.900%    9.95s
 99.990%   10.07s
 99.999%   10.08s
100.000%   10.08s

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      82.623     0.000000            1         1.00
      96.383     0.100000         1088         1.11
     105.087     0.200000         2177         1.25
     160.767     0.300000         3261         1.43
    1579.007     0.400000         4348         1.67
    2658.303     0.500000         5437         2.00
    3465.215     0.550000         5981         2.22
    4288.511     0.600000         6525         2.50
    5128.191     0.650000         7065         2.86
    5779.455     0.700000         7614         3.33
    6397.951     0.750000         8152         4.00
    6844.415     0.775000         8425         4.44
    7245.823     0.800000         8702         5.00
    7532.543     0.825000         8971         5.71
    7761.919     0.850000         9240         6.67
    7966.719     0.875000         9519         8.00
    8097.791     0.887500         9648         8.89
    8282.111     0.900000         9784        10.00
    8486.911     0.912500         9921        11.43
    8683.519     0.925000        10054        13.33
    8880.127     0.937500        10195        16.00
    8962.047     0.943750        10261        17.78
    9060.351     0.950000        10326        20.00
    9166.847     0.956250        10394        22.86
    9281.535     0.962500        10474        26.67
    9355.263     0.968750        10532        32.00
    9404.415     0.971875        10566        35.56
    9453.567     0.975000        10599        40.00
    9510.911     0.978125        10639        45.71
    9560.063     0.981250        10679        53.33
    9584.639     0.984375        10700        64.00
    9625.599     0.985938        10718        71.11
    9650.175     0.987500        10737        80.00
    9682.943     0.989062        10753        91.43
    9699.327     0.990625        10768       106.67
    9732.095     0.992188        10786       128.00
    9756.671     0.992969        10795       142.22
    9781.247     0.993750        10804       160.00
    9797.631     0.994531        10814       182.86
    9805.823     0.995313        10821       213.33
    9822.207     0.996094        10834       256.00
    9822.207     0.996484        10834       284.44
    9830.399     0.996875        10839       320.00
    9838.591     0.997266        10842       365.71
    9863.167     0.997656        10844       426.67
    9879.551     0.998047        10848       512.00
    9895.935     0.998242        10850       568.89
    9920.511     0.998437        10854       640.00
    9928.703     0.998633        10855       731.43
    9945.087     0.998828        10858       853.33
    9953.279     0.999023        10859      1024.00
    9969.663     0.999121        10860      1137.78
    9994.239     0.999219        10861      1280.00
   10002.431     0.999316        10862      1462.86
   10018.815     0.999414        10863      1706.67
   10035.199     0.999512        10865      2048.00
   10035.199     0.999561        10865      2275.56
   10035.199     0.999609        10865      2560.00
   10043.391     0.999658        10866      2925.71
   10043.391     0.999707        10866      3413.33
   10059.775     0.999756        10867      4096.00
   10059.775     0.999780        10867      4551.11
   10059.775     0.999805        10867      5120.00
   10067.967     0.999829        10868      5851.43
   10067.967     0.999854        10868      6826.67
   10067.967     0.999878        10868      8192.00
   10067.967     0.999890        10868      9102.22
   10067.967     0.999902        10868     10240.00
   10076.159     0.999915        10869     11702.86
   10076.159     1.000000        10869          inf
#[Mean    =     3503.531, StdDeviation   =     3246.632]
#[Max     =    10067.968, Total count    =        10869]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  11595 requests in 2.00m, 4.12MB read
  Socket errors: connect 0, read 0, write 0, timeout 28
  Non-2xx or 3xx responses: 11595
Requests/sec:     96.50
Transfer/sec:     35.15KB

Run #3

Running 2m test @ https://staging-api.thriveglobal.com/users/initialize
  12 threads and 12 connections
  Thread calibration: mean lat.: 124.897ms, rate sampling interval: 463ms
  Thread calibration: mean lat.: 124.759ms, rate sampling interval: 460ms
  Thread calibration: mean lat.: 139.921ms, rate sampling interval: 520ms
  Thread calibration: mean lat.: 123.215ms, rate sampling interval: 397ms
  Thread calibration: mean lat.: 136.240ms, rate sampling interval: 518ms
  Thread calibration: mean lat.: 136.239ms, rate sampling interval: 517ms
  Thread calibration: mean lat.: 126.921ms, rate sampling interval: 418ms
  Thread calibration: mean lat.: 136.158ms, rate sampling interval: 501ms
  Thread calibration: mean lat.: 137.267ms, rate sampling interval: 510ms
  Thread calibration: mean lat.: 123.727ms, rate sampling interval: 396ms
  Thread calibration: mean lat.: 123.432ms, rate sampling interval: 394ms
  Thread calibration: mean lat.: 125.541ms, rate sampling interval: 396ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   244.03ms  424.38ms   2.14s    90.84%
    Req/Sec     7.81      1.60    12.00     96.31%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  102.01ms
 75.000%  122.37ms
 90.000%  520.70ms
 99.000%    2.04s
 99.900%    2.13s
 99.990%    2.14s
 99.999%    2.14s
100.000%    2.14s

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      84.031     0.000000            1         1.00
      92.543     0.100000         1105         1.11
      94.847     0.200000         2217         1.25
      97.023     0.300000         3338         1.43
      99.199     0.400000         4405         1.67
     102.015     0.500000         5502         2.00
     104.319     0.550000         6060         2.22
     107.135     0.600000         6609         2.50
     110.591     0.650000         7156         2.86
     115.199     0.700000         7704         3.33
     122.367     0.750000         8253         4.00
     126.591     0.775000         8529         4.44
     131.199     0.800000         8811         5.00
     138.239     0.825000         9082         5.71
     154.751     0.850000         9356         6.67
     209.407     0.875000         9629         8.00
     348.927     0.887500         9767         8.89
     520.703     0.900000         9904        10.00
     743.423     0.912500        10042        11.43
     999.423     0.925000        10179        13.33
    1250.303     0.937500        10317        16.00
    1360.895     0.943750        10386        17.78
    1481.727     0.950000        10455        20.00
    1611.775     0.956250        10523        22.86
    1723.391     0.962500        10592        26.67
    1805.311     0.968750        10662        32.00
    1835.007     0.971875        10696        35.56
    1864.703     0.975000        10729        40.00
    1881.087     0.978125        10764        45.71
    1909.759     0.981250        10799        53.33
    1943.551     0.984375        10834        64.00
    1964.031     0.985938        10851        71.11
    1991.679     0.987500        10868        80.00
    2024.447     0.989062        10886        91.43
    2043.903     0.990625        10903       106.67
    2058.239     0.992188        10923       128.00
    2067.455     0.992969        10927       142.22
    2078.719     0.993750        10936       160.00
    2087.935     0.994531        10945       182.86
    2093.055     0.995313        10955       213.33
    2095.103     0.996094        10968       256.00
    2095.103     0.996484        10968       284.44
    2096.127     0.996875        10970       320.00
    2103.295     0.997266        10976       365.71
    2109.439     0.997656        10983       426.67
    2109.439     0.998047        10983       512.00
    2111.487     0.998242        10989       568.89
    2111.487     0.998437        10989       640.00
    2111.487     0.998633        10989       731.43
    2113.535     0.998828        10992       853.33
    2127.871     0.999023        10999      1024.00
    2127.871     0.999121        10999      1137.78
    2127.871     0.999219        10999      1280.00
    2127.871     0.999316        10999      1462.86
    2127.871     0.999414        10999      1706.67
    2127.871     0.999512        10999      2048.00
    2129.919     0.999561        11002      2275.56
    2129.919     0.999609        11002      2560.00
    2129.919     0.999658        11002      2925.71
    2129.919     0.999707        11002      3413.33
    2129.919     0.999756        11002      4096.00
    2129.919     0.999780        11002      4551.11
    2129.919     0.999805        11002      5120.00
    2138.111     0.999829        11004      5851.43
    2138.111     1.000000        11004          inf
#[Mean    =      244.031, StdDeviation   =      424.382]
#[Max     =     2136.064, Total count    =        11004]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  12012 requests in 2.00m, 4.27MB read
  Non-2xx or 3xx responses: 12012
Requests/sec:     99.99
Transfer/sec:     36.42KB